using System;

namespace Первое_задание
{
    class Program
    {
        static void Main(string[] args)
        {
            bool isItNum;
            int n =0, m, k;

            Console.WriteLine("Введите максимальный балл для сдачи, в котором 51% этого балла норматив будет выполнен");
            Int32.TryParse(Console.ReadLine(), out m);

            do
            {
                isItNum = Int32.TryParse(Console.ReadLine(), out k);
                if ((m / 100) * 51 <= k) // < > != ==
                {
                    n++;
                }
            } while (isItNum);
            Console.WriteLine($"Колличество студентов выполнивших норматив: {n}");
            Console.ReadKey();
        }
    }
}
















/*

ЗАПУСКАЕМ
░ГУСЯ░▄▀▀▀▄░РАБОТЯГИ░░
▄███▀░◐░░░▌░░░░░░░
░░░░▌░░░░░▐░░░░░░░
░░░░▐░░░░░▐░░░░░░░
░░░░▌░░░░░▐▄▄░░░░░
░░░░▌░░░░▄▀▒▒▀▀▀▀▄
░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄
░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄
░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄
░░░░░░▀▄▄▄▄▄█▄▄▄▄▄▄▄▄▄▄▄▀▄
░░░░░░░░░░░▌▌░▌▌░░░░░
░░░░░░░░░░░▌▌░▌▌░░░░░
░░░░░░░░░▄▄▌▌▄▌▌░░░░░

*/





